app/controllers/researches_controller.rb

SELECT "researches".* FROM "researches"
---
  def index
    @researches = Research.all